RIET/src/AccumulationRegisters/ОборудованиеDSS/ОборудованиеDSS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборудованиеDSS</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроводкаДеталейСКП</name>
    <type>
      <types>DocumentRef.ПроводкаDSS</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/ОборудованиеDSS/Forms/ФормаВыбора/Module.bsl
&НаКлиенте
Процедура ОборудованиеDSSВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаРегистра = Элемент.ТекущиеДанные;
	СтруктураВыбора = Новый Структура("ПроводкаDSS,Стоимость,Номенклатура,Количество");
	СтруктураВыбора.ПроводкаDSS = СтрокаРегистра.ПроводкаДеталейСКП;
	СтруктураВыбора.Стоимость = СтрокаРегистра.СуммаРуб;
	СтруктураВыбора.Номенклатура = СтрокаРегистра.Номенклатура;
	СтруктураВыбора.Количество = СтрокаРегистра.Количество;
	ОповеститьОВыборе(СтруктураВыбора);
	
КонецПроцедуры
